//ハローワールドを出力するプログラムの作り方
//まずはクラスの作成をします

public class Main3 {

//メイン関数を左から順に下記に記載します  
 
public static void main(String[] args){

    //**クラスの外からアクセスしたいので「public」を指定します。
    //**クラスはデータ型ですがその中にあるデータを使用したいので「static」を指定します。
    //**今回は戻り値は必要ありませんので「void」を指定します。
    //**関数の名前は「main」とします。
    //**カッコ内の引数としては「string」型の配列、「args」というのを渡します。

    
    System.out.println("Hello, world!");

    //文字を出力させたいので上記内容を記載します。
    /*("")←カッコ内に文字を入力すると出力されます。
    　　　　この（“”）は検索窓を想像するとわかりやすいです。*/

    //ここまで入力出来たら「control+ｓ」で保存して出力してみましょう。
    //出力するには名前を付けて作成したファイルで右クリック→「Run java」を選択しましょう。
    
    //「Hello, world!」と出力されたら正解です。
    //お疲れさまでした。
    }
}
